In [21]:
import pandas as pd

In [22]:
dic_data = {'Name':['Ali' , 'Umer' , 'Aatif' , 'Ayan'],
            'Age':[22 , None , 31 , None],
            'Salary':[120000 , 100000 , None , None]}
df = pd.DataFrame(dic_data)
print('Original DataFrame')
df

Original DataFrame

    Name   Age    Salary
0    Ali  22.0  120000.0
1   Umer   NaN  100000.0
2  Aatif  31.0       NaN
3   Ayan   NaN       NaN

In [23]:
df.isnull().mean()

Name      0.0
Age       0.5
Salary    0.5
dtype: float64

In [24]:
df.isnull().sum()

Name      0
Age       2
Salary    2
dtype: int64

In [25]:
df.dropna()

  Name   Age    Salary
0  Ali  22.0  120000.0

In [26]:
# fillna Age k column main null values ko fill krein
df['Age'].fillna(df['Age'].mean() , inplace=True)
df

    Name   Age    Salary
0    Ali  22.0  120000.0
1   Umer  26.5  100000.0
2  Aatif  31.0       NaN
3   Ayan  26.5       NaN

In [27]:
# fillna Salary k column main null values ko fill krein
df['Salary'].fillna(df['Salary'].mean() , inplace=True)
df

    Name   Age    Salary
0    Ali  22.0  120000.0
1   Umer  26.5  100000.0
2  Aatif  31.0  110000.0
3   Ayan  26.5  110000.0

# Label Encoded

In [28]:
# import libraries
from sklearn.preprocessing import LabelEncoder
import pandas as pd

In [29]:
# call csv
df = pd.read_csv('BeforeEncoded.csv' , index_col=[0])
df

     Name   Age  Gender
0     Ali  24.0    Male
1   Usman  29.0    Male
2  Farooq  33.0    Male
3   Zahid  39.0    Male
4  Zohaib  39.5    Male
5  Aaliya  20.0  Female
6   Sadaf  22.0  Female
7   Hania  26.0  Female

In [30]:
df_label = df.copy()
print('Before Encoded')
df_label

Before Encoded

     Name   Age  Gender
0     Ali  24.0    Male
1   Usman  29.0    Male
2  Farooq  33.0    Male
3   Zahid  39.0    Male
4  Zohaib  39.5    Male
5  Aaliya  20.0  Female
6   Sadaf  22.0  Female
7   Hania  26.0  Female

In [31]:
le = LabelEncoder()

In [32]:
df_label['gender_encoded'] = le.fit_transform(df['Gender'])
print('After Encoded')
df_label

After Encoded

     Name   Age  Gender  gender_encoded
0     Ali  24.0    Male               1
1   Usman  29.0    Male               1
2  Farooq  33.0    Male               1
3   Zahid  39.0    Male               1
4  Zohaib  39.5    Male               1
5  Aaliya  20.0  Female               0
6   Sadaf  22.0  Female               0
7   Hania  26.0  Female               0

### One hot encoded
### Use --> get_dummies

In [33]:
data = {
    "Name": ["Ali", "Sara", "Ahmed", "Ayesha"],
    "Gender": ["Male", "Female", "Male", "Female"],
    "City": ["Lahore", "Karachi", "Lahore", "Islamabad"]
}

df = pd.DataFrame(data)
print(df)

     Name  Gender       City
0     Ali    Male     Lahore
1    Sara  Female    Karachi
2   Ahmed    Male     Lahore
3  Ayesha  Female  Islamabad

In [34]:
df_encoded = pd.get_dummies(df , columns=['City'])
df_encoded

     Name  Gender  City_Islamabad  City_Karachi  City_Lahore
0     Ali    Male           False         False         True
1    Sara  Female           False          True        False
2   Ahmed    Male           False         False         True
3  Ayesha  Female            True         False        False

In [35]:
import pandas as pd

In [36]:
dic_data = {'Name':['Ali' , 'Umer' , 'Aatif' , 'Ayan'],
            'Age':[22 , None , 31 , None],
            'Salary':[120000 , 100000 , None , None]}
df = pd.DataFrame(dic_data)
print('Original DataFrame')
df

Original DataFrame

    Name   Age    Salary
0    Ali  22.0  120000.0
1   Umer   NaN  100000.0
2  Aatif  31.0       NaN
3   Ayan   NaN       NaN

In [37]:
df.isnull().mean()

Name      0.0
Age       0.5
Salary    0.5
dtype: float64

In [38]:
df.isnull().sum()

Name      0
Age       2
Salary    2
dtype: int64

In [69]:
df['Age'].fillna(df['Age'].mean() , inplace=True)
df

     Name   Age  Gender
0     Ali  24.0    Male
1   Usman  29.0    Male
2  Farooq  33.0    Male
3   Zahid  39.0    Male
4  Zohaib  39.5    Male
5  Aaliya  20.0  Female
6   Sadaf  22.0  Female
7   Hania  26.0  Female